using System;

namespace DoubleMaze.Game
{
    public static class NameGenerator
    {
        private static string[] FirstPart =
        {
            "Быстрый",
            "Неспешный",
            "Ленивый",
            "Энергичный",
            "Толстый",
            "Худой",
            "Задумчивый",
            "Резвый",
            "Суровый",
            "Хромой",
            "Сонный",
            "Весёлый",
            "Грустный",
            "Жизнерадостный",
            "Забавный",
            "Остроумный",
            "Находчивый",
            "Торопливый",
            "Квёлый",
            "Борзый",
            "Милый",
            "Расчётливый",
            "Приветливый",
            "Улыбчивый",
            "Задорный",
            "Стройный",
        };

        private static string[] SecondPart =
        {
            "ленивец",
            "попугай",
            "слон",
            "носорог",
            "жираф",
            "заяц",
            "медведь",
            "волк",
            "пёс",
            "суслик",
            "сурок",
            "кот",
            "петух",
            "енот",
            "бык",
            "опоссум",
            "орёл",
            "воробей",
            "голубь",
            "скат",
            "карась",
            "кит",
            "дельфин",
            "зяблик",
            "тюлень",
            "дятел",
            "муравей",
            "комар",
            "шмель",
            "шершень",
            "верблюд",
            "утконос",
            "окунь",
            "воран",
            "павлин",
            "фламинго",
            "броненосец",
            "пингвин",
        };

        private static Random rand = new Random();

        public static string GenerateName()
        {
            lock (rand)
            {
                return FirstPart[rand.Next(FirstPart.Length)] + " " + SecondPart[rand.Next(SecondPart.Length)];
            }
        }
    }
}
